#pragma once

//=============================================================
// Renderer.h
// レンダラークラスの定義
//=============================================================

#ifndef _Renderer_h_
#define _Renderer_h_

#include <d3d9.h>
#include <d3dx9.h>

#include "Common.h"

//=============================================================
// 依存するクラス
//=============================================================
class Scene;

//=============================================================
// Renderer
// レンダラークラス
//=============================================================
class Renderer
{
public:
	//---------------------------------------------------------
	// デフォルトコンストラクタ
	//---------------------------------------------------------
	Renderer();

	//---------------------------------------------------------
	// デストラクタ
	//---------------------------------------------------------
	~Renderer();

public:
	//---------------------------------------------------------
	// レンダラーの初期化
	// 引数
	//		hWnd         : ウィンドウハンドル
	//		isFullScreen : フルスクリーンの場合TRUE
	//		clientWidth  : クライアント領域の幅
	//		clientHeight : クライアント領域の高さ
	// 戻り値
	//		成功したらS_OK 
	//---------------------------------------------------------
	HRESULT Initialize(HWND hWnd, BOOL isFullScreen, int clientWidth, int clientHeight);

	//---------------------------------------------------------
	// デバイスの取得
	// 戻り値
	//		成功したらIDirect3DDevice9インターフェイスへのポインタ
	//		失敗したら0
	//---------------------------------------------------------
	LPDIRECT3DDEVICE9 GetDevice();

	//---------------------------------------------------------
	// シーンの描画
	// 引数
	//		pScene : シーンへのポインタ
	// 戻り値
	//		成功したらS_OK 
	//---------------------------------------------------------
	void RenderScene(Scene* pScene);

	//---------------------------------------------------------
	// 終了処理
	//---------------------------------------------------------
	void Finalize();

private:
	LPDIRECT3D9				m_pD3D;			// IDirect3D9インターフェイスへのポインタ
	LPDIRECT3DDEVICE9		m_pD3DDevice;	// IDirect3DDevice9インターフェイスへのポインタ
	D3DPRESENT_PARAMETERS	m_D3DPP;		// デバイスのプレゼンテーションパラメータ
};

#endif //_Renderer_h_